In [163]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [164]:
df_train=pd.read_csv("train.csv")

In [165]:
df_train.head()

           from-to  score
0    6320501-27657    0.0
1  6310893-6295314    1.0
2  6285646-6303434    3.0
3   870193-6275811    1.0
4  6270099-6270025    0.0

In [166]:
df_train.dtypes

from-to     object
score      float64
dtype: object

In [167]:
df_train['user_A'] = df_train['from-to'].str.split('-', expand = True)[0]
df_train['user_B'] = df_train['from-to'].str.split('-', expand = True)[1]

In [168]:
df_train.head()

           from-to  score   user_A   user_B
0    6320501-27657    0.0  6320501    27657
1  6310893-6295314    1.0  6310893  6295314
2  6285646-6303434    3.0  6285646  6303434
3   870193-6275811    1.0   870193  6275811
4  6270099-6270025    0.0  6270099  6270025

In [169]:
df_train=df_train.drop(['from-to'], axis=1)

In [170]:
df_train.head()

   score   user_A   user_B
0    0.0  6320501    27657
1    1.0  6310893  6295314
2    3.0  6285646  6303434
3    1.0   870193  6275811
4    0.0  6270099  6270025

In [171]:
df_train=df_train.astype({'user_A':'int64'})
df_train.dtypes

score     float64
user_A      int64
user_B     object
dtype: object

In [172]:
df_ages=pd.read_csv("user_ages.csv")

In [173]:
df_ages.head()

   user_id   age
0        0   4.0
1      151  33.0
2       41  36.0
3       51  41.0
4    19670  30.0

In [174]:
df_ages=df_ages.rename(columns={'user_id': 'user_A'}, index={'ONE': 'one'})

In [175]:
df_ages.head()

   user_A   age
0       0   4.0
1     151  33.0
2      41  36.0
3      51  41.0
4   19670  30.0

In [176]:
df_ages.dtypes

user_A      int64
age       float64
dtype: object

In [177]:
#df_ages=df_ages.astype({'user_A': 'object'})

In [178]:
df_ages.dtypes

user_A      int64
age       float64
dtype: object

In [179]:
result = pd.merge(df_train, df_ages, on='user_A',how='inner')

In [180]:
result.head()

   score   user_A   user_B   age
0    0.0  6320501    27657  65.0
1    0.0  6320501  1010623  65.0
2    0.0  6320501   228994  65.0
3    0.0  6320501  6281647  65.0
4    0.0  6320501  4747494  65.0

In [181]:
result=result.rename(columns={'age':'user_A_age'})

In [182]:
df_ages=df_ages.rename(columns={'user_A':'user_B'})

In [183]:
result=result.astype({'user_B':'int64'})

In [184]:
result = pd.merge(result, df_ages, on='user_B',how='inner')

In [185]:
result.head()

   score   user_A  user_B  user_A_age   age
0    0.0  6320501   27657        65.0  44.0
1    1.0  1044966   27657        43.0  44.0
2    1.0   408187   27657        44.0  44.0
3    0.0    22663   27657        29.0  44.0
4    1.0   996127   27657        39.0  44.0

In [186]:
result=result.rename(columns={'age':'user_B_age'})

In [187]:
result.head()

   score   user_A  user_B  user_A_age  user_B_age
0    0.0  6320501   27657        65.0        44.0
1    1.0  1044966   27657        43.0        44.0
2    1.0   408187   27657        44.0        44.0
3    0.0    22663   27657        29.0        44.0
4    1.0   996127   27657        39.0        44.0

In [188]:
result=result.astype({'score':'object'})

In [189]:
#plt.figure(figsize=(15,10))
#sns.scatterplot(x='user_A_age',y='user_B_age',hue='score',size="score",sizes=(20, 200),data=result[result['score']==0])

In [190]:
df_train_shortened=pd.read_csv("df_train_shortened.csv")

In [191]:
df_train_shortened.head()

,from-to,score,userA_id,userB_id,has_common_skills,n_common_skills
0,4769697-6308211,3.0,4769697,6308211,0,-1
1,2227465-17278,3.0,2227465,17278,0,-1
2,31105-531,2.0,31105,531,0,-1
3,24072-1012437,0.0,24072,1012437,1,1
4,829489-49256,2.0,829489,49256,1,5

In [192]:
result=result.rename(columns={'user_A':'userA_id','user_B':'userB_id'})

In [193]:
result.head()

  score  userA_id  userB_id  user_A_age  user_B_age
0     0   6320501     27657        65.0        44.0
1     1   1044966     27657        43.0        44.0
2     1    408187     27657        44.0        44.0
3     0     22663     27657        29.0        44.0
4     1    996127     27657        39.0        44.0

In [194]:
df_train_shortened = pd.merge( df_train_shortened,result, on=['userA_id','userB_id','score'],how='inner')

In [195]:
df_train_shortened.head()

,from-to,score,userA_id,userB_id,has_common_skills,n_common_skills,user_A_age,user_B_age
0,4769697-6308211,3,4769697,6308211,0,-1,37.0,28.0
1,2227465-17278,3,2227465,17278,0,-1,49.0,NaN
2,31105-531,2,31105,531,0,-1,42.0,44.0
3,24072-1012437,0,24072,1012437,1,1,36.0,44.0
4,829489-49256,2,829489,49256,1,5,33.0,31.0

In [196]:
df_train_shortened.count()

from-to              30896
score                30896
userA_id             30896
userB_id             30896
has_common_skills    30896
n_common_skills      30896
user_A_age           30747
user_B_age           30630
dtype: int64

In [197]:
df_train_shortened.isnull().values.sum()

415

In [198]:
df_train_shortened.isnull()

,from-to,score,userA_id,userB_id,has_common_skills,n_common_skills,user_A_age,user_B_age
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
30891,False,False,False,False,False,False,False,False
30892,False,False,False,False,False,False,False,False
30893,False,False,False,False,False,False,False,False
30894,False,False,False,False,False,False,False,False
30895,False,False,False,False,False,False,False,False

In [204]:

df_train_shortened['user_A_age'].fillna(value=df_train_shortened['user_A_age'].mean(), inplace=True)
df_train_shortened['user_B_age'].fillna(value=df_train_shortened['user_B_age'].mean(), inplace=True)

In [205]:
df_train_shortened.isnull().values.sum()

0

In [212]:
df_user_works=pd.read_csv("user_works.csv")
df_user_works.dtypes

user_id        int64
company_id     int64
industry_id    int64
dtype: object

In [207]:
df_user_works.head()

   user_id  company_id  industry_id
0        0           1            2
1      151           1            2
2      151           1            9
3       41           1            2
4       41           1            9

In [214]:
df_user_works=df_user_works.rename(columns={'user_id':'userA_id'})
df_user_works.head()

   userA_id  company_id  industry_id
0         0           1            2
1       151           1            2
2       151           1            9
3        41           1            2
4        41           1            9

In [215]:
df_train_shortened = pd.merge( df_train_shortened,df_user_works, on=['userA_id'],how='inner')

In [217]:
df_train_shortened.head()

,from-to,score,userA_id,userB_id,has_common_skills,n_common_skills,user_A_age,user_B_age,company_id,industry_id
0,4769697-6308211,3,4769697,6308211,0,-1,37.0,28.0,7117,2
1,4769697-6308211,3,4769697,6308211,0,-1,37.0,28.0,7117,9
2,4769697-6308211,3,4769697,6308211,0,-1,37.0,28.0,7117,149
3,4769697-24342,2,4769697,24342,0,-1,37.0,33.0,7117,2
4,4769697-24342,2,4769697,24342,0,-1,37.0,33.0,7117,9

In [219]:
df_train_shortened.count() #Before this we had 30 k rows but after executing merge between work and train we got 121710 rows. Please check this

from-to              121710
score                121710
userA_id             121710
userB_id             121710
has_common_skills    121710
n_common_skills      121710
user_A_age           121710
user_B_age           121710
company_id           121710
industry_id          121710
dtype: int64